{
  "Tell me about a time you solved a complex problem": {
    "situation": "At Manhattan Associates, we were facing inconsistencies in SLA reporting due to disparate data sources from Jira, ServiceNow, and Oracle.",
    "task": "I was tasked with standardizing the ingestion process and ensuring accurate, automated reporting for operations leadership.",
    "action": "I engineered ingestion pipelines using Power Query and Dataflows, applied robust data validation logic, and built parameterized refresh schedules. I also added visual alerts for SLA breaches.",
    "result": "This reduced SLA violations by 18%, improved stakeholder trust, and eliminated 40% of manual tracking tasks.",
    "skills": [
      "Power Query",
      "Dataflows",
      "ETL",
      "Root Cause Analysis",
      "Data Validation",
      "Cross-functional Collaboration"
    ]
  },
  "Describe a time you improved a process": {
    "situation": "At Northside Hospital, the Community Health Needs Assessment (CHNA) reports were built manually using Excel and static charts.",
    "task": "I needed to modernize this process to make the reporting faster and more insightful.",
    "action": "I used Power BI and public health datasets to build interactive dashboards, added drill-through filters, and automated the data pipeline using Power Query.",
    "result": "Turnaround time for CHNA reporting was reduced by 50%, and the team could easily track real-time community health indicators.",
    "skills": [
      "Power BI",
      "Power Query",
      "Process Automation",
      "Data Visualization",
      "Public Data Integration",
      "Efficiency Improvement"
    ]
  },
  "Tell me about a time you had to work with a difficult stakeholder": {
    "situation": "At Hiscox Insurance, I was working with regional underwriting leads who had conflicting priorities regarding dashboard KPIs.",
    "task": "I had to unify these views while respecting role-based access and differing reporting needs.",
    "action": "I conducted stakeholder interviews, developed separate RLS-filtered views in Power BI, and built a dynamic reporting layer using semantic models.",
    "result": "This improved satisfaction across teams, reduced access issues, and created a unified dashboard experience across four business units.",
    "skills": [
      "Stakeholder Management",
      "Power BI",
      "RLS (Row-Level Security)",
      "Requirement Gathering",
      "Conflict Resolution",
      "Data Governance"
    ]
  },
  "Give an example of how you handled a tight deadline": {
    "situation": "At Costco, we had to deploy a merchandising dashboard for an upcoming board review with less than a week’s notice.",
    "task": "I was responsible for integrating multi-source retail data and building an executive-ready dashboard.",
    "action": "I used Databricks with SSIS and Power Query to ingest and transform data quickly, while using templates and existing components to accelerate dashboard creation.",
    "result": "The dashboard was delivered ahead of schedule, reducing manual reporting by 40% and was reused in three other departments.",
    "skills": [
      "Databricks",
      "SSIS",
      "Power Query",
      "Time Management",
      "Rapid Prototyping",
      "Executive Communication"
    ]
  }
}
